LEXICON_RU: dict[str, str] = {
    "start": "\U0001f44b Приветствую!\nЯ могу вам помочь распланировать любое путешествие.\
        \nДалее необходимо ввести свои данные, чтобы заполнить профиль:\
        \nСколько вам лет?",
    "help": "\U0001f916 Я могу вам помочь распланировать любое путешествие: не потерять важные документы, построить маршрут, найти новых друзей, поделить расходы, увидеть достопримечательности и узнать прогноз погоды на протяжении маршрута.\
        \n\n\U0001f4a1 Для начала необходимо пройти небольшую процедуру регистрации /start . После этого вы сможете воспользоваться основным функционалом бота /menu",
    "menu": "\U0001f9f3	Главное меню бота",
    "set_sex": "\U0001f464 Укажите ваш пол",
    "set_location": "\U0001f310 Теперь установим ваше местоположение",
    "set_currency": "\U0001f4b0 Выберите вашу валюту",
    "set_bio": "\U0001f4cb На данном этапе вы можете рассказать о себе, либо оставить это поле пустым",
    "settings_done": "\U00002699 Настройка профиля завершена! Теперь вы можете с легкостью планировать свои поездки. Вот основное меню бота",
    "edit_profile": "\U0001f4c5 Отредактируйте ваш возраст",
    "edit_sex": "\U0001f464 Отредактируйте ваш пол",
    "edit_location": "\U0001f310 Теперь отредактируем ваше местоположение",
    "edit_currency": "\U0001f4b0 Отредактируйте вашу валюту",
    "edit_bio": '\U0001f4cb Отредактируйте раздел "О себе"',
    "my_trips": "\U0001f5fa Ваши путешествия",
    "new_trip": "\U0001f3f7 Для начала придумайте название для вашего путешествия",
    "trip_description": "\U0001f4cb Теперь вы можете ввести краткое описание, либо оставить это поле пустым",
    "trip_destination": "\U0001f310 Чтобы установить первую точку маршрута используйте встроенную в Telegram функцию отправки местоположения",
    "trip_dates": "\U0001f4c5 Введите сроки пребывания в этом месте в формате:\nДД.ММ.ГГГГ-ДД.ММ.ГГГГ",
    "trip_created": "\U0001f3d4 Путешествие создано! Теперь вы можете его дополнять и редактировать в разделе ниже",
    "edit_trip": "\U0001f3f7 Отредактируйте название путешествия",
    "edit_description": "\U0001f4cb Отредактируйте краткое описание путешествия",
    "editing_done": "\U0000270f Редактирование завершено!",
    "confirm_deletion": "\U0001f628 Вы уверены, что хотите удалить?",
    "deletion_done": "\U0001f5d1 Удаление завершено!",
    "deletion_canceled": "\U0001f60c Удаление отменено",
    "my_notes": "\U0001f4d3 Ваши заметки",
    "new_note": "\U0001f510 Перед созданием заметки выберите, будет ли она видна для других участников путешествия",
    "upload_file": "\U0001f4c1 Вы можете прикреплять файлы размером до 20 Мб, одна загрузка - один файл",
    "uploading_done": "\U0001f4c1 Загрузка файла завершена!",
    "friends": "\U0001f465 Друзья, участвующие в поездке",
    "add_friend": "\U0001f465 Чтобы пригласить друга в путешествие введите его ник в формате @example",
    "friend_addition_done": "\U0001f465 Пользователь добавлен!",
    "found_friends": "\U0001f50e Я выполнил поиск по вашему возрасту и интересами, вот кого я нашел",
    "locations": "\U0001f9ed Локации",
    "new_location": "\U0001f310 Чтобы добавить новую точку маршрута используйте встроенную в Telegram функцию отправки местоположения",
    "location_addded": "\U0001f9ed Локация добавлена",
    "location_dates": "\U0001f4c5 Теперь введите сроки пребывания в этом месте в формате:\nДД.ММ.ГГГГ-ДД.ММ.ГГГГ",
    "route": "\U0001f310 Маршрут путешествия",
    "wait": "\U000023f3 Немного подождите, идет построение маршрута...",
    "weather_limitations": "\U0001f4a1 Прогноз может содержать не все дни, так как он доступен лишь на 16 дней вперед",
    "landmarks_limitations": "\U0001f4a1 В маленьких городах количество достопримечательностей может быть меньше 10",
    "select_currency": "\U0001fa99 Выберите, во что будем конвертировать вашу валюту",
    "enter_amount": "\U0001f4b0 Введите количество",
    "expenses": "\U0001f4b3 Вот все неразделенные траты",
    "new_expense": "\U0001f3f7 Введите название траты",
    "new_debtor": "\U0001f464 Введите имя пользователя нового должника в формате @example",
    "debtor_added": "\U0001f464 Должник добавлен!",
    "expense_cost": "\U0001f9fe Введите сумму, которую вы заплатили в своей валюте",
    "expense_debtors": "\U0001f465 Теперь из списка участников путешествия выпишите должников в формате:\n@example, @example, @example",
    "expense_added": "\U0001f4b8 Траты записаны!",
    "edit_expense": "\U0001f3f7 Отредактируйте название траты",
    "edit_cost": "\U0001f9fe Отредактируйте сумму, которую вы заплатили в своей валюте",
    "confirm_write_off": "\U0001f911 Подтвердите возврат долга",
    "write_off_done": "\U0001f4b0 Долг возвращен!",
    "write_off_done_closed": "\U0001f4b0 Долг возвращен и трата закрыта!",
    "write_off_canceled": "\U0001f4b0 Возврат долга отменен",
    "play_game": "\U0001f608 Предлагаю сыграть в игру: случайным образом будет выбран должник, на которого спишутся все долги остальных людей. Сыграем?",
    "game_loser": "Теперь он/она оплачивает все долги",
    "unknown": "\U0001f6ab Извините, к сожалению, я вас не понимаю.\
                \nЕсли вы что-то настраиваете, то следуйте командам и вводите корректные данные",
}


KB_LEXICON_RU: dict[str, str] = {
    "male": "\U0001f468 М",
    "female": "\U0001f469 Ж",
    "set_location": "\U0001f4cd Установить местоположение",
    "leave_blank": "\U0001f4cb Сделать пустым",
    "leave_same": "\U0001f4dd Не редактировать",
    "my_trips": "\U0001f5fa Мои путешествия",
    "new_trip": "\U0001f9ed Новое путешествие",
    "edit": "\U0000270f	Редактировать",
    "friends": "\U0001f465 Друзья",
    "locations": "\U0001f9ed Локации",
    "route": "\U0001f9ed Маршрут",
    "weather": "\U0001f324 Погода",
    "notes": "\U0001f4d3 Заметки",
    "landmarks": "\U0001f5fd Достопримечательности",
    "currency": "\U0001f4b1 Конвертер валют",
    "expenses": "\U0001f9fe Траты",
    "delete": "\U0000274c Удалить",
    "cancel_deletion": "\U00002b55 Не удалять",
    "new_note": "\U0001f4d3 Новая заметка",
    "private_note": "\U0001f512 Закрытая",
    "unprivate_note": "\U0001f513 Открытая",
    "back_to_trip": "\U0001f519 К путешествию",
    "back_to_notes": "\U0001f519 К заметкам",
    "add_friend": "\U0001f4dd Добавить друга",
    "find_friends": "\U0001f50e Найти друзей",
    "add_user": "\U00002709 Пригласить в путешествие",
    "back_to_found_users": "\U0001f519 В раздел поиска друзей",
    "back_to_friends": "\U0001f519 В раздел друзей",
    "new_location": "\U0001f310 Новая локация",
    "back_to_locations": "\U0001f519 В локации",
    "back_to_location": "\U0001f519 К локации",
    "new_expense": "\U0001f4b3 Новые траты",
    "new_expense_debtor": "\U0001f464 Добавить должника",
    "back_to_expenses": "\U0001f519 К тратам",
    "back_to_expense": "\U0001f519 К тратe",
    "write_off_debt": "\U0001f4b8 Возврат долга",
    "write_off": "\U0000274c Вернуть",
    "cancel_write_off": "\U00002b55 Не возвращать",
    "expense_game": "\U0001f3b2 Кто за всех платит",
    "play": "\U0001f3b2 Сыграть",
}


LEXICON_COMMANDS_RU: dict[str, str] = {
    "/menu": "\U0001f5c2 Главное меню",
    "/profile": "\U0001f464 Ваш профиль",
    "/help": "\U0001f916 О боте",
}


ERROR_LEXICON_RU: dict[str, str] = {
    "no_profile": "\U000026a0 Вашего профиля пока что не существует, пройдите процедуру регистрации /start",
    "no_username": "\U000026a0 Для корректной работы бота необходимо указать имя пользователя в формате @example в настройках Telegram аккаунта, установите его и повторите попытку /start",
    "incorrect_data": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nПроверьте корректность введенных данных и повторите попытку",
    "incorrect_file": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nФайл данного типа не поддерживается, либо он слишком большой",
    "cant_add_yourself": "\U000026a0 Вы уже участвуете в этом путешествии",
    "InternalError": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nПроизошла внутренняя ошибка, повторите попытку позже",
    "DatabaseError": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nВозникла ошибка во время работы с базой данных, повторите попытку позже",
    "UserNotFoundError": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nПользователь с таким ником не зарегистрирован в системе, проверьте корректность введенных данных и повторите попытку",
    "UserNotInTripError": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nПользователь с таким ником не участвует в данном путешествии, проверьте корректность введенных данных и повторите попытку",
    "UserInListNotFoundError": "\U0001f6ab <b>Произошла ошибка!</b>\
       \nОдин из пользователей не зарегистрирован в системе, проверьте корректность введенных данных и повторите попытку",
    "GeocodingError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nВозникла ошибка во время определения местоположения, повторите попытку позже",
    "LocationExistsError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nДанная локация уже есть в списке, добавьте другую",
    "InvalidDateError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nСроки пребывания в локациях не должны пересекаться",
    "NavigationError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nВозникла ошибка при построении маршрута, вероятно, он слишком длинный, максимальная длина маршрута - 6000 км",
    "IsStartPointError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nДанная точка совпадает с начальной точкой маршрута",
    "NoLocationsError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nЧтобы построить маршрут необходимо указать хотя бы одну локацию в путешествии",
    "WeatherDateError": "\U000026a0 Прогноз погоды доступен только на 16 дней вперед",
    "ServiceConnectionError": "\U0001f6ab <b>Произошла ошибка!</b>\
        \nВозникла ошибка при работе со сторонним сервисом, повторите попытку позже",
}
